espruino/Espruino/targets/nrf5x/bluetooth.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------

#define ADVERTISE_MAX_UUIDS             4 ///< maximum custom UUIDs to advertise

#if NRF_SD_BLE_API_VERSION < 5
static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
#else
BLE_NUS_DEF(m_nus);                                                                 /**< Structure to identify the Nordic UART Service. */
#endif

#if BLE_HIDS_ENABLED
#if NRF_SD_BLE_API_VERSION < 5
static ble_hids_t                       m_hids;                                   /**< Structure used to identify the HID service. */
#else
BLE_HIDS_DEF(m_hids);
#endif
static bool                             m_in_boot_mode = false;
#endif

volatile uint16_t                       m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
#if CENTRAL_LINK_COUNT>0
volatile uint16_t                       m_central_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle for central mode connection */
#endif
#ifdef USE_NFC
volatile bool nfcEnabled = false;
#endif

uint16_t bleAdvertisingInterval = DEFAULT_ADVERTISING_INTERVAL;

volatile BLEStatus bleStatus = 0;
ble_uuid_t bleUUIDFilter;
uint16_t bleFinalHandle;

/* If we're received an advertising message it's put in here and then a message
 * to process it is shoved in the queue. Not 100% ideal if we don't get around
 * to processing it in time... Could shove all the data in the queue? */
static ble_gap_evt_adv_report_t blePendingAdvReport;


// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------

void jsble_queue_pending_d(BLEPending blep, uint16_t data) {
  JsSysTime d = (JsSysTime)((data<<8)|blep);
  jshPushIOEvent(EV_BLUETOOTH_PENDING, d);
  jshHadEvent();
}

void jsble_queue_pending(BLEPending blep) {
  jsble_queue_pending_d(blep,0);
}

void jsble_exec_pending(IOEvent *event) {
  BLEPending blep = (BLEPending)event->data.time;
  uint16_t data = (uint16_t)(event->data.time>>8);
  switch (blep) {
   case BLEP_NONE: break;
   case BLEP_DISCONNECTED: {
     JsVar *reason = jsvNewFromInteger(data);
     bleQueueEventAndUnLock(JS_EVENT_PREFIX"disconnect", reason);
     break;
   }
   case BLEP_RSSI_PERIPH: {
     JsVar *evt = jsvNewFromInteger((char)data);
     if (evt) jsiQueueObjectCallbacks(execInfo.root, BLE_RSSI_EVENT, &evt, 1);
     jsvUnLock(evt);
     break;
   }
   case BLEP_ADV_REPORT: {
     JsVar *evt = jsvNewObject();
     if (evt) {
       jsvObjectSetChildAndUnLock(evt, "rssi", jsvNewFromInteger(blePendingAdvReport.rssi));
       //jsvObjectSetChildAndUnLock(evt, "addr_type", jsvNewFromInteger(blePendingAdvReport.peer_addr.addr_type));
       jsvObjectSetChildAndUnLock(evt, "id", bleAddrToStr(blePendingAdvReport.peer_addr));
       JsVar *data = jsvNewStringOfLength(blePendingAdvReport.dlen, (char*)blePendingAdvReport.data);
       if (data) {
         JsVar *ab = jsvNewArrayBufferFromString(data, blePendingAdvReport.dlen);
         jsvUnLock(data);
         jsvObjectSetChildAndUnLock(evt, "data", ab);
       }
       // push onto queue
       jsiQueueObjectCallbacks(execInfo.root, BLE_SCAN_EVENT, &evt, 1);
       jsvUnLock(evt);
     }
     break;
   }
#if CENTRAL_LINK_COUNT>0
   case BLEP_RSSI_CENTRAL: {
     JsVar *gattServer = bleGetActiveBluetoothGattServer();
     if (gattServer) {
       JsVar *rssi = jsvNewFromInteger((char)data);
       JsVar *bluetoothDevice = jsvObjectGetChild(gattServer, "device", 0);
       if (bluetoothDevice) {
         jsvObjectSetChild(bluetoothDevice, "rssi", rssi);
       }
       jsiQueueObjectCallbacks(gattServer, BLE_RSSI_EVENT, &rssi, 1);
       jsvUnLock3(rssi, gattServer, bluetoothDevice);
     }
     break;
   }
   case BLEP_TASK_FAIL_CONN_TIMEOUT:
     bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), jsvNewFromString("Connection Timeout"));
     break;
   case BLEP_TASK_FAIL_DISCONNECTED:
     bleCompleteTaskFailAndUnLock(bleGetCurrentTask(), jsvNewFromString("Disconnected"));
   case BLEP_TASK_CENTRAL_CONNECTED:
     jsvObjectSetChildAndUnLock(bleTaskInfo, "connected", jsvNewFromBool(true));
     bleCompleteTaskSuccess(BLETASK_CONNECT, bleTaskInfo);
     break;
   case BLEP_GATT_SERVER_DISCONNECTED: {
     JsVar *gattServer = bleGetActiveBluetoothGattServer();
     if (gattServer) {
       JsVar *bluetoothDevice = jsvObjectGetChild(gattServer, "device", 0);
       jsvObjectSetChildAndUnLock(gattServer, "connected", jsvNewFromBool(false));
       if (bluetoothDevice) {
         // HCI error code, see BLE_HCI_STATUS_CODES in ble_hci.h
         JsVar *reason = jsvNewFromInteger(data);
         jsiQueueObjectCallbacks(bluetoothDevice, JS_EVENT_PREFIX"gattserverdisconnected", &reason, 1);
         jsvUnLock(reason);
         jshHadEvent();
       }
       jsvUnLock2(gattServer, bluetoothDevice);
     }
     bleSetActiveBluetoothGattServer(0);
     break;
   }
#endif
#ifdef USE_NFC
   case BLEP_NFC_STATUS:
     bleQueueEventAndUnLock(data ? JS_EVENT_PREFIX"NFCon" : JS_EVENT_PREFIX"NFCoff", 0);
     break;
#endif
   default:
     jsWarn("jsble_exec_pending: Unknown enum type %d",(int)blep);
 }
}


// -----------------------------------------------------------------------------------
// -----------------------------------------------------------------------------------


/** Is BLE connected to any device at all? */
bool jsble_has_connection() {
#if CENTRAL_LINK_COUNT>0
  return (m_central_conn_handle != BLE_CONN_HANDLE_INVALID) ||
         (m_conn_handle != BLE_CONN_HANDLE_INVALID);
#else
  return m_conn_handle != BLE_CONN_HANDLE_INVALID;
#endif
}

/** Is BLE connected to a central device at all? */
bool jsble_has_central_connection() {
#if CENTRAL_LINK_COUNT>0
  return (m_central_conn_handle != BLE_CONN_HANDLE_INVALID);
#else
  return false;
#endif
}

