espruino/Espruino/targets/nrf5x/bluetooth.c
      case BLE_GATTC_EVT_READ_RSP: if (bleInTask(BLETASK_CHARACTERISTIC_READ)) {
        ble_gattc_evt_read_rsp_t *p_read = &p_ble_evt->evt.gattc_evt.params.read_rsp;

        JsVar *data = jsvNewDataViewWithData(p_read->len, (unsigned char*)&p_read->data[0]);
        jsvObjectSetChild(bleTaskInfo, "value", data); // set this.value
        bleCompleteTaskSuccessAndUnLock(BLETASK_CHARACTERISTIC_READ, data);
        break;
      }

      case BLE_GATTC_EVT_WRITE_RSP: {
        if (bleInTask(BLETASK_CHARACTERISTIC_NOTIFY))
          bleCompleteTaskSuccess(BLETASK_CHARACTERISTIC_NOTIFY, 0);
        else if (bleInTask(BLETASK_CHARACTERISTIC_WRITE))
          bleCompleteTaskSuccess(BLETASK_CHARACTERISTIC_WRITE, 0);
        break;
      }

      case BLE_GATTC_EVT_HVX: {
        // Notification/Indication
        ble_gattc_evt_hvx_t *p_hvx = &p_ble_evt->evt.gattc_evt.params.hvx;
        // p_hvx>type is BLE_GATT_HVX_NOTIFICATION or BLE_GATT_HVX_INDICATION
        JsVar *handles = jsvObjectGetChild(execInfo.hiddenRoot, "bleHdl", 0);
        if (handles) {
          JsVar *characteristic = jsvGetArrayItem(handles, p_hvx->handle);
          if (characteristic) {
            // Set characteristic.value, and return {target:characteristic}
            jsvObjectSetChildAndUnLock(characteristic, "value",
                jsvNewDataViewWithData(p_hvx->len, (unsigned char*)p_hvx->data));
            // TODO: queue event with jsble_queue_pending
            JsVar *evt = jsvNewObject();
            if (evt) {
              jsvObjectSetChild(evt, "target", characteristic);
              jsiQueueObjectCallbacks(characteristic, JS_EVENT_PREFIX"characteristicvaluechanged", &evt, 1);
              jshHadEvent();
              jsvUnLock(evt);
            }
          }
          jsvUnLock2(characteristic, handles);
        }
        break;
      }
#endif

      default:
          // No implementation needed.
          break;
    }
}

#ifdef USE_NFC
/// Callback function for handling NFC events.
static void nfc_callback(void * p_context, hal_nfc_event_t event, const uint8_t * p_data, size_t data_length) {
  (void)p_context;

  switch (event) {
    case HAL_NFC_EVENT_FIELD_ON:
      jsble_queue_pending_d(BLEP_NFC_STATUS,1);
      break;
    case HAL_NFC_EVENT_FIELD_OFF:
      jsble_queue_pending_d(BLEP_NFC_STATUS,0);
      break;
    case HAL_NFC_EVENT_DATA_RECEIVED: {
      /* try to fetch NfcData data */
      JsVar *nfcData = jsvObjectGetChild(execInfo.hiddenRoot, "NfcData", 0);
      if(nfcData) {
        /* success handle request internally */
        JSV_GET_AS_CHAR_ARRAY(nfcDataPtr, nfcDataLen, nfcData);
        jsvUnLock(nfcData);

        /* check data, on error let request go into timeout - reader will retry. */
        if (!nfcDataPtr || !nfcDataLen) {
          break;
        }

        /* check rx data length and read block command code (0x30) */
        if(data_length < 2 || p_data[0] != 0x30) {
          jsble_nfc_send_rsp(0, 0); /* switch to rx */
          break;
        }

        /* fetch block index (addressing is done in multiples of 4 byte */
        size_t idx = p_data[1] * 4;

        /* assemble 16 byte block */
        uint8_t buf[16]; memset(buf, '\0', 16);
        if(idx + 16 < nfcDataLen) {
          memcpy(buf, nfcDataPtr + idx, 16);
        } else
        if(idx < nfcDataLen) {
          memcpy(buf, nfcDataPtr + idx, nfcDataLen - idx);
        }
        /* send response */
        jsble_nfc_send(buf, 16);
      } else {
        /* no NfcData available, fire js-event */
        char *ptr = 0;
        JsVar *arr = jsvNewArrayBufferWithPtr((unsigned int)data_length, &ptr);
        if (ptr) memcpy(ptr, p_data, data_length);
        bleQueueEventAndUnLock(JS_EVENT_PREFIX"NFCrx", arr);
      }
      break;
    }
    case HAL_NFC_EVENT_DATA_TRANSMITTED:
      bleQueueEventAndUnLock(JS_EVENT_PREFIX"NFCtx", 0);
      break;
    default:
      break;
  }
}
#endif

#if NRF_SD_BLE_API_VERSION<5
/// Function for dispatching a SoftDevice event to all modules with a SoftDevice event handler.
static void ble_evt_dispatch(ble_evt_t * p_ble_evt) {
#if PEER_MANAGER_ENABLED
  ble_conn_state_on_ble_evt(p_ble_evt);
  pm_on_ble_evt(p_ble_evt);

#endif
  if (!((p_ble_evt->header.evt_id==BLE_GAP_EVT_CONNECTED) &&
        (p_ble_evt->evt.gap_evt.params.connected.role != BLE_GAP_ROLE_PERIPH)) &&
      !((p_ble_evt->header.evt_id==BLE_GAP_EVT_DISCONNECTED) &&
         m_conn_handle != p_ble_evt->evt.gap_evt.conn_handle)) {
    // Stuff in here should ONLY get called for Peripheral events (not central)
    ble_conn_params_on_ble_evt(p_ble_evt);
    if (bleStatus & BLE_NUS_INITED)
      ble_nus_on_ble_evt(&m_nus, p_ble_evt);
  }
#if BLE_HIDS_ENABLED
  if (bleStatus & BLE_HID_INITED)
    ble_hids_on_ble_evt(&m_hids, p_ble_evt);
#endif
  ble_evt_handler(p_ble_evt);
}
#endif

/// Function for dispatching a system event to interested modules.
#if NRF_SD_BLE_API_VERSION<5
static void soc_evt_handler(uint32_t sys_evt) {
#else
static void soc_evt_handler(uint32_t sys_evt, void * p_context) {
#endif
#if PEER_MANAGER_ENABLED
  // Dispatch the system event to the fstorage module, where it will be
  // dispatched to the Flash Data Storage (FDS) module.
  fs_sys_event_handler(sys_evt);
#endif
  void jsh_sys_evt_handler(uint32_t sys_evt);
  jsh_sys_evt_handler(sys_evt);
}

#if PEER_MANAGER_ENABLED
/// Function for handling Peer Manager events.
static void pm_evt_handler(pm_evt_t const * p_evt) {
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_DEBUG("Connected to previously bonded device\r\n");
            m_peer_id = p_evt->peer_id;
            err_code  = pm_peer_rank_highest(p_evt->peer_id);
            if (err_code != NRF_ERROR_BUSY)
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_CONN_SEC_START:
          if (bleInTask(BLETASK_BONDING))
            bleCompleteTaskSuccess(BLETASK_BONDING, 0);
            break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_DEBUG("Link secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
                                 -1/*ble_conn_state_role(p_evt->conn_handle)*/,
                                 p_evt->conn_handle,
                                 p_evt->params.conn_sec_succeeded.procedure);
            m_peer_id = p_evt->peer_id;
            err_code  = pm_peer_rank_highest(p_evt->peer_id);
            if (err_code != NRF_ERROR_BUSY)
            {
                APP_ERROR_CHECK(err_code);
            }
            if (p_evt->params.conn_sec_succeeded.procedure == PM_LINK_SECURED_PROCEDURE_BONDING &&
                bleStatus & BLE_WHITELIST_ON_BOND)
            {
                NRF_LOG_DEBUG("New Bond, add the peer to the whitelist if possible\r\n");
                NRF_LOG_DEBUG("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d\r\n",
                               m_whitelist_peer_cnt + 1,
                               BLE_GAP_WHITELIST_ADDR_MAX_COUNT);
                if (m_whitelist_peer_cnt < BLE_GAP_WHITELIST_ADDR_MAX_COUNT)
                {
                    //bonded to a new peer, add it to the whitelist.
                    // but first check it's not in there already!
                    uint32_t i;
                    bool found = false;
                    for (i=0;i<m_whitelist_peer_cnt;i++)
                      if (m_whitelist_peers[i]==m_peer_id)
                        found = true;
                    // not in already, so add it!
                    if (!found) {
                      m_whitelist_peers[m_whitelist_peer_cnt++] = m_peer_id;
                      m_is_wl_changed = true;
                    }
                }
                //Note: This code will use the older bonded device in the white list and not add any newer bonded to it
                //      You should check on what kind of white list policy your application should use.
            }
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
          if (bleInTask(BLETASK_BONDING))
            bleCompleteTaskFailAndUnLock(BLETASK_BONDING, jsvNewFromString("Securing failed"));
            /** In some cases, when securing fails, it can be restarted directly. Sometimes it can
             *  be restarted, but only after changing some Security Parameters. Sometimes, it cannot
             *  be restarted until the link is disconnected and reconnected. Sometimes it is
             *  impossible, to secure the link, or the peer device does not support it. How to
             *  handle this error is highly application dependent. */
            switch (p_evt->params.conn_sec_failed.error)
            {
                case PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING:
                    // Rebond if one party has lost its keys.
                    err_code = pm_conn_secure(p_evt->conn_handle, true);
                    if (err_code != NRF_ERROR_INVALID_STATE)
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                    break; // PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING

                default:
                    break;
            }
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            // Still allow a device to pair if it doesn't have bonding info for us
            /* TODO: we could turn this off with a flag? Stops someone reconnecting
             * by spoofing a peer. */
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = true };
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

